src/cf/InformationRegisters/вогНастройкиОтображенияКлассификаторов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>вогНастройкиОтображенияКлассификаторов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НастройкиМакета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Включен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИспользоватьОтбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Наименоваине</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.вогВидНастройкиМакетаСправочника</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/CRM_ВидыОтображенияКлассификаторов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>CRM_ВидыОтображенияКлассификаторов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Тег</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вхождение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОдиночноеЗначение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДополнительныйРеквизит</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтдельнымСписком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщимСписком</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/CRM_ЗначенияКлассификаторов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>CRM_ЗначенияКлассификаторов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>ChartOfCharacteristicTypes.CRM_Классификаторы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроекКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяШаблонаСКД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныйРеквизит</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CRM_ДополнительныеРеквизитыКлассификаторов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/вогНастройкиОтображенияКлассификаторов/Forms/НастройкаКлассификатора/Ext/Form/Module.bsl
// + Тищенко В.В.

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Классификатор = Параметры.Классификатор;
	
	Если НЕ ЗначениеЗаполнено(Классификатор) Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Если ЭтоАдресВременногоХранилища(Параметры.Адрес) Тогда
		ВходящаяСтруктура 				= ПолучитьИзВременногоХранилища(Параметры.Адрес);
		СписокЗначенийКлассификатора	= ЗначениеИзСтрокиВнутр(ВходящаяСтруктура.Значение);
	КонецЕсли;
	
	//Если ЭтоАдресВременногоХранилища(Параметры.СписокРасшифровкиКлассификатора) Тогда
	//	СписокРасшифровкиКлассификатора.Загрузить(ПолучитьИзВременногоХранилища(Параметры.СписокРасшифровкиКлассификатора));
	//	ИспользоватьРасшифровку = СписокРасшифровкиКлассификатора.Количество() <> 0;
	//КонецЕсли;
	
	Параметры.Свойство("ИспользоватьРасшифровкуДляОтчета", ИспользоватьРасшифровкуДляОтчета);
	
	ОтображатьЗаголовокКлассификатора 				= Параметры.ОтображатьЗаголовок;
	ВыводитьТолькоЗаполненныеЗначения				= Параметры.ВыводитьТолькоЗаполненныеЗначения;
	
	Если ВходящаяСтруктура <> Неопределено Тогда
		Если ВходящаяСтруктура.Свойство("ИспользоватьАналитику") Тогда
			ИспользоватьАналитику							= ВходящаяСтруктура.ИспользоватьАналитику;
		КонецЕсли;
	КонецЕсли;
	
	ПолучитьСписокЗначенийКлассификатора();
	ЗаполнитьСписокРасшифровкиКлассификатора(Параметры.СписокРасшифровкиКлассификатора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"СписокРасшифровкиКлассификатора","Видимость",ИспользоватьРасшифровку);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ИспользоватьРасшифровкуДляОтчета","Видимость",ИспользоватьРасшифровку);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИспользоватьРасшифровкуПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"СписокРасшифровкиКлассификатора","Видимость",ИспользоватьРасшифровку);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,"ИспользоватьРасшифровкуДляОтчета","Видимость",ИспользоватьРасшифровку);
	
	Если ИспользоватьРасшифровку Тогда 
		ЗаполнитьКлассификаторы(Неопределено); 
	Иначе
		
		СписокРасшифровкиТекущегоКлассификатора.Очистить();
		
		Для каждого Стр Из СписокЗначенийКлассификатора Цикл
			
			СтруктураПоиска = Новый Структура("Имя", Стр.Значение);
			МассивНайденных = СписокРасшифровкиКлассификатора.НайтиСтроки(СтруктураПоиска);
			
			Для Каждого ЭлементМассива Из МассивНайденных Цикл
				СписокРасшифровкиКлассификатора.Удалить(ЭлементМассива);
			КонецЦикла;
			
		КонецЦикла;
		
		ИспользоватьРасшифровкуДляОтчета = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокЗначенийКлассификатора

&НаКлиенте
Процедура СписокЗначенийКлассификатораПометкаПриИзменении(Элемент)
	
	Если ИспользоватьРасшифровку Тогда
		
		ТекущиеДанные = Элементы.СписокЗначенийКлассификатора.ТекущиеДанные;
		
		Если ТекущиеДанные.Пометка Тогда
			
			СтрокаДобавления 		= СписокРасшифровкиТекущегоКлассификатора.Добавить();
			СтрокаДобавления.Имя 	= ТекущиеДанные.Значение;
			
		Иначе
			
			СтруктураПоиска = Новый Структура("Имя", ТекущиеДанные.Значение);
			МассивНайденных = СписокРасшифровкиТекущегоКлассификатора.НайтиСтроки(СтруктураПоиска);
			
			Для Каждого ЭлементМассива Из МассивНайденных Цикл
				СписокРасшифровкиТекущегоКлассификатора.Удалить(ЭлементМассива);
			КонецЦикла;
			
		КонецЕсли;
			
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаРасшифровкиКлассификатора

&НаКлиенте
Процедура ЗаполнитьКлассификаторы(Команда)
	
	СписокРасшифровкиТекущегоКлассификатора.Очистить();
	
	Для каждого Стр Из СписокЗначенийКлассификатора Цикл
		Если Стр.Пометка Тогда
			СтрокаДобавления 		= СписокРасшифровкиТекущегоКлассификатора.Добавить();
			СтрокаДобавления.Имя 	= Стр.Значение;
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ИсходящаяСтруктура = Новый Структура("Имя,Значение,ОтображатьЗаголовок,ВыводитьТолькоЗаполненныеЗначения,СписокРасшифровкиКлассификатора,ИспользоватьРасшифровкуДляОтчета,ИспользоватьАналитику"
						,Классификатор,
						СериализоватьСписокЗначений(),
						ОтображатьЗаголовокКлассификатора,
						ВыводитьТолькоЗаполненныеЗначения,
						ВыгрузитьСписокРасшифровкиКлассификатора(),
						ИспользоватьРасшифровкуДляОтчета,
						ИспользоватьАналитику);
	Закрыть(ИсходящаяСтруктура);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПолучитьСписокЗначенийКлассификатора()

	Если Классификатор.ВидОтображения 	 = Перечисления.CRM_ВидыОтображенияКлассификаторов.ОтдельнымСписком
		ИЛИ Классификатор.ВидОтображения = Перечисления.CRM_ВидыОтображенияКлассификаторов.ОбщимСписком 
		ИЛИ Классификатор.ВидОтображения = Перечисления.CRM_ВидыОтображенияКлассификаторов.ДополнительныйРеквизит
		ИЛИ Классификатор.ВидОтображения = Перечисления.CRM_ВидыОтображенияКлассификаторов.Вхождение 
		ИЛИ Классификатор.ВидОтображения = Перечисления.CRM_ВидыОтображенияКлассификаторов.ОдиночноеЗначение Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	CRM_ЗначенияКлассификаторов.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ Классификаторы
		|ИЗ
		|	Справочник.CRM_ЗначенияКлассификаторов КАК CRM_ЗначенияКлассификаторов
		|ГДЕ
		|	CRM_ЗначенияКлассификаторов.Владелец = &ЗначениеКлассификатора
		|	И НЕ CRM_ЗначенияКлассификаторов.Ссылка В (&СписокКлассификаторов)
		|	И НЕ CRM_ЗначенияКлассификаторов.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Классификаторы.Ссылка КАК Ссылка
		|ИЗ
		|	Классификаторы КАК Классификаторы");
		Запрос.УстановитьПараметр("ЗначениеКлассификатора",Классификатор);
		Запрос.УстановитьПараметр("СписокКлассификаторов",СписокЗначенийКлассификатора.ВыгрузитьЗначения());
		РезультатЗапроса = Запрос.Выполнить();

		Если НЕ РезультатЗапроса.Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
			Пока ВыборкаИзРезультатаЗапроса.Следующий() Цикл
				СписокЗначенийКлассификатора.Добавить(ВыборкаИзРезультатаЗапроса.Ссылка, ,Истина, БиблиотекаКартинок.СтруктураПодчиненности);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СериализоватьСписокЗначений()
	Возврат ЗначениеВСтрокуВнутр(СписокЗначенийКлассификатора);
КонецФункции

&НаСервере
Функция ВыгрузитьСписокРасшифровкиКлассификатора()
	
	Для Каждого СтрТекущаяРасшифровка Из СписокРасшифровкиТекущегоКлассификатора Цикл
		
		СтруктураОтбора = Новый Структура("Имя", СтрТекущаяРасшифровка.Имя);
		МассивНайденных = СписокРасшифровкиКлассификатора.НайтиСтроки(СтруктураОтбора);
		
		Если МассивНайденных.Количество() = 0 Тогда
			НоваяСтрокаРасшифровки = СписокРасшифровкиКлассификатора.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаРасшифровки, СтрТекущаяРасшифровка);
		Иначе
			ЗаполнитьЗначенияСвойств(МассивНайденных[0], СтрТекущаяРасшифровка);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(СписокРасшифровкиКлассификатора.Выгрузить(),УникальныйИдентификатор);
	
КонецФункции 

&НаСервере
Процедура ЗаполнитьСписокРасшифровкиКлассификатора(Адрес)
	
	СписокРасшифровкиТекущегоКлассификатора.Очистить();
	
	Если ЭтоАдресВременногоХранилища(Адрес) Тогда
		
		СписокРасшифровкиКлассификатора.Загрузить(ПолучитьИзВременногоХранилища(Адрес));
		
		Для Каждого СтрЗначение Из СписокЗначенийКлассификатора Цикл
			
			СтруктураПоиска = Новый Структура("Имя", СтрЗначение.Значение);
			МассивНайденных = СписокРасшифровкиКлассификатора.НайтиСтроки(СтруктураПоиска);
			
			Для Каждого ЭлементМассива Из МассивНайденных Цикл
				
				НоваяСтрокаРасшифровки = СписокРасшифровкиТекущегоКлассификатора.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрокаРасшифровки, ЭлементМассива);
				
			КонецЦикла;
			
		КонецЦикла;
		
		ИспользоватьРасшифровку = СписокРасшифровкиТекущегоКлассификатора.Количество() <> 0;
		Если Не ИспользоватьРасшифровку Тогда
			ИспользоватьРасшифровкуДляОтчета = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

// - Тищенко В.В.
